micropython/micropython/ports/mimxrt/machine_can.c
static mp_uint_t machine_can_port_max_data_len(mp_uint_t flags) {
    #if MICROPY_HW_ENABLE_FDCAN
    if (flags & CAN_MSG_FLAG_FD_F) {
        return 64;
    }
    #endif
    return 8;
}

// Clear all filters
static void machine_can_port_clear_filters(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;

    // Clear the filters
    memset(port->flexcan_rx_fifo_config->idFilterTable, 0,
        sizeof(uint32_t) * port->flexcan_rx_fifo_config->idFilterNum);
    FLEXCAN_SetRxFifoConfig(port->can_inst, port->flexcan_rx_fifo_config, true);
    // Clear the masks. Kind of obsolete, since the mask is always
    // set with the filter.
    FLEXCAN_EnterFreezeMode(port->can_inst);
    for (int idx = 0; idx < CAN_FILTER_MASK_NUM; idx++) {
        port->can_inst->RXIMR[idx] = 0x3fffffff;
    }
    FLEXCAN_ExitFreezeMode(port->can_inst);
}

// The extmod layer calls this function in a loop with incrementing filter_idx
// values. It's up to the port how to apply the filters from here, and to raise
// an exception if there are too many.
//
// If the CAN_FILTERS_STD_EXT_SEPARATE flag is set to 1, filter_idx will
// enumerate standard id filters separately to extended id filters (the
// CAN_MSG_FLAG_EXT_ID bit in 'flags' differentiates the type).
static void machine_can_port_set_filter(machine_can_obj_t *self, int filter_idx, mp_uint_t can_id, mp_uint_t mask, mp_uint_t flags) {
    struct machine_can_port *port = self->port;

    if (filter_idx >= port->flexcan_rx_fifo_config->idFilterNum) {
        return;
    }
    if (flags & CAN_MSG_FLAG_EXT_ID) {
        can_id = FLEXCAN_ID_EXT(can_id) | (1 << 29);
        mask = FLEXCAN_ID_EXT(mask) | (1 << 29);
    } else {
        can_id = FLEXCAN_ID_STD(can_id);
        mask = FLEXCAN_ID_STD(mask);
    }
    if (flags & CAN_MSG_FLAG_RTR) {
        can_id |= 1 << 30;
        mask |= 1 << 30;
    }
    port->flexcan_rx_fifo_config->idFilterTable[filter_idx] = can_id << 1;
    if (filter_idx < CAN_FILTER_MASK_NUM) {
        FLEXCAN_SetRxIndividualMask(port->can_inst, filter_idx, mask << 1);
    }
    // TODO: Set a single filter instead of reloading all filters of the table
    // multiple times.
    FLEXCAN_SetRxFifoConfig(port->can_inst, port->flexcan_rx_fifo_config, true);
}

// Update interrupt configuration based on the new contents of 'self'
static void machine_can_update_irqs(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    uint16_t triggers = self->mp_irq_trigger;
    mp_uint_t enable_flags = 0;
    if (triggers & MP_CAN_IRQ_RX) {
        enable_flags |= kFLEXCAN_RxFifoFrameAvlFlag;
    }
    if (triggers & MP_CAN_IRQ_RX_OVERFLOW) {
        enable_flags |= kFLEXCAN_RxFifoOverflowFlag;
    }
    if (triggers & MP_CAN_IRQ_RX_WARNING) {
        enable_flags |= kFLEXCAN_RxFifoWarningFlag;
    }
    FLEXCAN_DisableMbInterrupts(port->can_inst,
        ~enable_flags & (kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag));
    FLEXCAN_EnableMbInterrupts(port->can_inst, enable_flags);
}

// Return the irq().flags() result. Calling this function may also update the hardware state machine.
static mp_uint_t machine_can_port_irq_flags(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    mp_int_t irq_flags = 0;

    // Maybe not disable the interrupts.
    if (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoOverflowFlag)) {
        irq_flags |= MP_CAN_IRQ_RX_OVERFLOW;
    }
    if (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoWarningFlag)) {
        irq_flags |= MP_CAN_IRQ_RX_WARNING;
    }
    if (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)) {
        irq_flags |= MP_CAN_IRQ_RX;
    }
    return irq_flags;
}

// Compare ID value and message Type
#define IS_MATCHING_ID_TYPE(i, cs) ((port->can_inst->MB[i].ID == frame->id) \
    && ((frame->format == kFLEXCAN_FrameFormatStandard) || (cs & CAN_CS_IDE_MASK)) \
    && ((frame->type == kFLEXCAN_FrameTypeData) || (cs & CAN_CS_RTR_MASK)))
// Compare ID value only
#define IS_MATCHING_ID(i) (port->can_inst->MB[i].ID == frame->id)
#define IS_MB_EMPTY(cs) ((cs & CAN_CS_CODE_MASK) != CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote))

static mp_uint_t can_find_txmb(machine_can_obj_t *self, flexcan_frame_t *frame, mp_uint_t flags) {
    struct machine_can_port *port = self->port;

    uint32_t tx_mb = 0;
    for (mp_uint_t i = port->flexcan_txmb_start; i < (port->flexcan_txmb_count + port->flexcan_txmb_start); i++) {
        uint32_t cs = port->can_inst->MB[i].CS;
        if (tx_mb == 0 && IS_MB_EMPTY(cs)) {
            tx_mb = i; // First free slot
            // Keep scanning, in case a higher numbered mbox has the same id
            // Except if CAN_MSG_FLAG_UNORDERED
            if (flags & CAN_MSG_FLAG_UNORDERED) {
                break;
            }
        } else if (tx_mb > 0 && IS_MATCHING_ID_TYPE(i, cs) && !IS_MB_EMPTY(cs)) {
            // This mailbox has a pending tx with the same id, so we can only pick a higher number
            // mbox to ensure correct ordering
            tx_mb = 0;
        }
    }
    return tx_mb;
}

static mp_int_t machine_can_port_send(machine_can_obj_t *self, mp_uint_t id, const byte *data, size_t data_len, mp_uint_t flags) {

    flexcan_frame_t tx_msg;

    tx_msg.dataWord0 = 0;
    tx_msg.dataWord1 = 0;

    if (data_len > 0) {
        tx_msg.dataByte0 = data[0];
    }
    if (data_len > 1) {
        tx_msg.dataByte1 = data[1];
    }
    if (data_len > 2) {
        tx_msg.dataByte2 = data[2];
    }
    if (data_len > 3) {
        tx_msg.dataByte3 = data[3];
    }
    if (data_len > 4) {
        tx_msg.dataByte4 = data[4];
    }
    if (data_len > 5) {
        tx_msg.dataByte5 = data[5];
    }
    if (data_len > 6) {
        tx_msg.dataByte6 = data[6];
    }
    if (data_len > 7) {
        tx_msg.dataByte7 = data[7];
    }
    tx_msg.length = data_len;
    tx_msg.type = (flags & CAN_MSG_FLAG_RTR) != 0;
    tx_msg.format = (flags & CAN_MSG_FLAG_EXT_ID) != 0;

    if (tx_msg.format) {
        tx_msg.id = FLEXCAN_ID_EXT(id);
    } else {
        tx_msg.id = FLEXCAN_ID_STD(id);
    }

