micropython/micropython/ports/mimxrt/machine_can.c
    uint32_t timeout_ms = 1000;
    uint32_t start = mp_hal_ticks_ms();
    mp_uint_t mbIdx;

    while (true) {
        mbIdx = can_find_txmb(self, &tx_msg);
        if (mbIdx && (FLEXCAN_WriteTxMb(self->port->can_inst, mbIdx, &tx_msg) == kStatus_Success)) {
            break;
        }
        if (timeout_ms == 0) {
            return -1;
        }
        // Check for the Timeout
        if (timeout_ms != UINT32_MAX) {
            if (mp_hal_ticks_ms() - start >= timeout_ms) {
                return -1;
            }
        }
        MICROPY_EVENT_POLL_HOOK
    }
    return mbIdx - self->port->flexcan_txmb_start;
}

static bool machine_can_port_cancel_send(machine_can_obj_t *self, mp_uint_t idx) {
    struct machine_can_port *port = self->port;

    if (idx >= port->flexcan_txmb_count) {
        return false;
    }
    uint64_t flag_mask = 1ull << (idx + port->flexcan_txmb_start);
    // Procedure according to RM "40.7.7.1 Transmission Abort Mechanism".
    // 1. Arm checks the corresponding IFLAG and clears it, if asserted.
    if (FLEXCAN_GetMbStatusFlags(port->can_inst, flag_mask)) {
        FLEXCAN_ClearMbStatusFlags(port->can_inst, flag_mask);
    }
    // 2. Arm writes 0b1001 into the CODE field of the C/S word.
    uint32_t cs_temp = port->can_inst->MB[idx + port->flexcan_txmb_start].CS;
    uint32_t cs_start = cs_temp & CAN_CS_CODE_MASK;
    cs_temp = (cs_temp & ~CAN_CS_CODE_MASK) | CAN_CS_CODE(kFLEXCAN_TxMbAbort);
    port->can_inst->MB[idx + port->flexcan_txmb_start].CS = cs_temp;
    // 3. Arm waits for the corresponding IFLAG indicating that the frame was either transmitted or aborted.
    //    Omitted because the flag is never set.
    // 4. Arm reads the CODE field to check if the frame was either transmitted (CODE=0b1000) or aborted (CODE=0b1001).
    uint32_t can_cs_code = (port->can_inst->MB[idx + port->flexcan_txmb_start].CS & CAN_CS_CODE_MASK);
    // Clear the MB to the initial state.
    port->can_inst->MB[idx + port->flexcan_txmb_start].CS = CAN_CS_CODE(kFLEXCAN_TxMbInactive);
    // 5. It is necessary to clear the corresponding IFLAG in order to allow the MB to be reconfigured.
    //    Seems obsolete, if it was never set. No code is generated by the compiler.
    FLEXCAN_ClearMbStatusFlags(port->can_inst, flag_mask);
    // Clear the MB to the initial state.
    port->can_inst->MB[idx + port->flexcan_txmb_start].CS = CAN_CS_CODE(kFLEXCAN_TxMbInactive);
    // Return True if at the beginning the MB was in use.
    return (cs_start == CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote)) && (cs_start != can_cs_code);
}

static bool machine_can_port_recv(machine_can_obj_t *self, void *data, size_t *dlen, mp_uint_t *id, mp_uint_t *flags, mp_uint_t *errors) {
    struct machine_can_port *port = self->port;

    if (!FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)) {
        return false;
    }

    flexcan_frame_t rx_frame;
    status_t status = FLEXCAN_ReadRxFifo(port->can_inst, &rx_frame);
    FLEXCAN_ClearMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
    *errors = status;

    FLEXCAN_EnableMbInterrupts(port->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);

    if (status != kStatus_Success) {
        return false;
    }

    *dlen = rx_frame.length;
    uint8_t *rx_data = data;

    if (*dlen > 0) {
        rx_data[0] = rx_frame.dataByte0;
    }
    if (*dlen > 1) {
        rx_data[1] = rx_frame.dataByte1;
    }
    if (*dlen > 2) {
        rx_data[2] = rx_frame.dataByte2;
    }
    if (*dlen > 3) {
        rx_data[3] = rx_frame.dataByte3;
    }
    if (*dlen > 4) {
        rx_data[4] = rx_frame.dataByte4;
    }
    if (*dlen > 5) {
        rx_data[5] = rx_frame.dataByte5;
    }
    if (*dlen > 6) {
        rx_data[6] = rx_frame.dataByte6;
    }
    if (*dlen > 7) {
        rx_data[7] = rx_frame.dataByte7;
    }

    *flags = (rx_frame.format ? CAN_MSG_FLAG_EXT_ID : 0) |
        (rx_frame.type ? CAN_MSG_FLAG_RTR : 0);
    *id = (rx_frame.id & 0x3fffffff) >> (rx_frame.format ? 0 : 18);

    return true;
}

static machine_can_state_t machine_can_port_get_state(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;

    if (port->is_enabled) {
        uint32_t result = FLEXCAN_GetStatusFlags(port->can_inst);
        uint32_t flt_conf = (result & CAN_ESR1_FLTCONF_MASK) >> CAN_ESR1_FLTCONF_SHIFT;
        if (flt_conf > 1) {
            return MP_CAN_STATE_BUS_OFF;
        }
        if (flt_conf == 1) {
            return MP_CAN_STATE_PASSIVE;
        }
        if ((result & CAN_ESR1_RXWRN_MASK) || (result & CAN_ESR1_TXWRN_MASK)) {
            return MP_CAN_STATE_WARNING;
        }
        // flt_conf == 0
        return MP_CAN_STATE_ACTIVE;
    }
    return MP_CAN_STATE_STOPPED;
}

static void machine_can_port_restart(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    // Disable FLEXCAN MB interrupts
    FLEXCAN_DisableMbInterrupts(port->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
    // Disable the MP IRQ
    self->mp_irq_obj->handler = NULL;
    self->mp_irq_trigger = 0;
    // Clear counts
    port->num_error_warning = 0;
    port->num_error_passive = 0;
    port->num_bus_off = 0;
    // Cancel all pending TX MBs
    for (mp_uint_t idx = 0; idx < port->flexcan_txmb_count; idx++) {
        machine_can_port_cancel_send(self, idx);
    }
    // Drain the FIFO
    flexcan_frame_t rx_frame;
    while (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag) != 0) {
        FLEXCAN_ReadRxFifo(port->can_inst, &rx_frame);
        FLEXCAN_ClearMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
    }
    // Clear all filters
    machine_can_port_clear_filters(self);
    // Re-enable FLEXCAN MB interrupts
    FLEXCAN_EnableMbInterrupts(port->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
    // Since Bit BOFF_REC of CTRL1 is 0, bus off recovery happens automatic.
}

static mp_uint_t can_count_txmb_pending(machine_can_port_t *port) {
    mp_uint_t count = 0;
    for (mp_uint_t i = 0; i < port->flexcan_txmb_count; i++) {
        if (!IS_MB_EMPTY(port->can_inst->MB[port->flexcan_txmb_start + i].CS)) {
            count++;
        }
    }
    return count;
}

// Updates values in self->counters (which counters are updated by this function versus from ISRs and the like
// is port specific
static void machine_can_port_update_counters(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    machine_can_counters_t *counters = &self->counters;

    uint8_t tec;
    uint8_t rec;
    FLEXCAN_GetBusErrCount(port->can_inst, &tec, &rec);
    counters->tec = tec;
    counters->rec = rec;
    counters->num_warning = port->num_error_warning;
    counters->num_passive = port->num_error_passive;
    counters->num_bus_off = port->num_bus_off;
    counters->tx_pending = can_count_txmb_pending(port);
    counters->rx_pending = FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag) != 0;
    counters->rx_overruns = 0;
}

// Hook for port to fill in the final item of the get_timings() result list with controller-specific values
static mp_obj_t machine_can_port_get_additional_timings(machine_can_obj_t *self, mp_obj_t optional_arg) {
    return mp_const_none;
}
